____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, None, None, 3) 0                                            
____________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D) (None, None, None, 3) 0                                            
____________________________________________________________________________________________________
conv1 (Conv2D)                   (None, None, None, 64 9472                                         
____________________________________________________________________________________________________
bn_conv1 (FixedBatchNormalizatio (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_1 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)   (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2a_branch2a (Conv2D)          (None, None, None, 64 4160                                         
____________________________________________________________________________________________________
bn2a_branch2a (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_2 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2a_branch2b (Conv2D)          (None, None, None, 64 36928                                        
____________________________________________________________________________________________________
bn2a_branch2b (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_3 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2a_branch2c (Conv2D)          (None, None, None, 25 16640                                        
____________________________________________________________________________________________________
res2a_branch1 (Conv2D)           (None, None, None, 25 16640                                        
____________________________________________________________________________________________________
bn2a_branch2c (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
bn2a_branch1 (FixedBatchNormaliz (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
add_1 (Add)                      (None, None, None, 25 0                                            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res2b_branch2a (Conv2D)          (None, None, None, 64 16448                                        
____________________________________________________________________________________________________
bn2b_branch2a (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_5 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2b_branch2b (Conv2D)          (None, None, None, 64 36928                                        
____________________________________________________________________________________________________
bn2b_branch2b (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_6 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2b_branch2c (Conv2D)          (None, None, None, 25 16640                                        
____________________________________________________________________________________________________
bn2b_branch2c (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
add_2 (Add)                      (None, None, None, 25 0                                            
____________________________________________________________________________________________________
activation_7 (Activation)        (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res2c_branch2a (Conv2D)          (None, None, None, 64 16448                                        
____________________________________________________________________________________________________
bn2c_branch2a (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_8 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2c_branch2b (Conv2D)          (None, None, None, 64 36928                                        
____________________________________________________________________________________________________
bn2c_branch2b (FixedBatchNormali (None, None, None, 64 256                                          
____________________________________________________________________________________________________
activation_9 (Activation)        (None, None, None, 64 0                                            
____________________________________________________________________________________________________
res2c_branch2c (Conv2D)          (None, None, None, 25 16640                                        
____________________________________________________________________________________________________
bn2c_branch2c (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
add_3 (Add)                      (None, None, None, 25 0                                            
____________________________________________________________________________________________________
activation_10 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res3a_branch2a (Conv2D)          (None, None, None, 12 32896                                        
____________________________________________________________________________________________________
bn3a_branch2a (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_11 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3a_branch2b (Conv2D)          (None, None, None, 12 147584                                       
____________________________________________________________________________________________________
bn3a_branch2b (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_12 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3a_branch2c (Conv2D)          (None, None, None, 51 66048                                        
____________________________________________________________________________________________________
res3a_branch1 (Conv2D)           (None, None, None, 51 131584                                       
____________________________________________________________________________________________________
bn3a_branch2c (FixedBatchNormali (None, None, None, 51 2048                                         
____________________________________________________________________________________________________
bn3a_branch1 (FixedBatchNormaliz (None, None, None, 51 2048                                         
____________________________________________________________________________________________________
add_4 (Add)                      (None, None, None, 51 0                                            
____________________________________________________________________________________________________
activation_13 (Activation)       (None, None, None, 51 0                                            
____________________________________________________________________________________________________
res3b_branch2a (Conv2D)          (None, None, None, 12 65664                                        
____________________________________________________________________________________________________
bn3b_branch2a (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_14 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3b_branch2b (Conv2D)          (None, None, None, 12 147584                                       
____________________________________________________________________________________________________
bn3b_branch2b (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_15 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3b_branch2c (Conv2D)          (None, None, None, 51 66048                                        
____________________________________________________________________________________________________
bn3b_branch2c (FixedBatchNormali (None, None, None, 51 2048                                         
____________________________________________________________________________________________________
add_5 (Add)                      (None, None, None, 51 0                                            
____________________________________________________________________________________________________
activation_16 (Activation)       (None, None, None, 51 0                                            
____________________________________________________________________________________________________
res3c_branch2a (Conv2D)          (None, None, None, 12 65664                                        
____________________________________________________________________________________________________
bn3c_branch2a (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_17 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3c_branch2b (Conv2D)          (None, None, None, 12 147584                                       
____________________________________________________________________________________________________
bn3c_branch2b (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_18 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3c_branch2c (Conv2D)          (None, None, None, 51 66048                                        
____________________________________________________________________________________________________
bn3c_branch2c (FixedBatchNormali (None, None, None, 51 2048                                         
____________________________________________________________________________________________________
add_6 (Add)                      (None, None, None, 51 0                                            
____________________________________________________________________________________________________
activation_19 (Activation)       (None, None, None, 51 0                                            
____________________________________________________________________________________________________
res3d_branch2a (Conv2D)          (None, None, None, 12 65664                                        
____________________________________________________________________________________________________
bn3d_branch2a (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_20 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3d_branch2b (Conv2D)          (None, None, None, 12 147584                                       
____________________________________________________________________________________________________
bn3d_branch2b (FixedBatchNormali (None, None, None, 12 512                                          
____________________________________________________________________________________________________
activation_21 (Activation)       (None, None, None, 12 0                                            
____________________________________________________________________________________________________
res3d_branch2c (Conv2D)          (None, None, None, 51 66048                                        
____________________________________________________________________________________________________
bn3d_branch2c (FixedBatchNormali (None, None, None, 51 2048                                         
____________________________________________________________________________________________________
add_7 (Add)                      (None, None, None, 51 0                                            
____________________________________________________________________________________________________
activation_22 (Activation)       (None, None, None, 51 0                                            
____________________________________________________________________________________________________
res4a_branch2a (Conv2D)          (None, None, None, 25 131328                                       
____________________________________________________________________________________________________
bn4a_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_23 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4a_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4a_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_24 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4a_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
res4a_branch1 (Conv2D)           (None, None, None, 10 525312                                       
____________________________________________________________________________________________________
bn4a_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
bn4a_branch1 (FixedBatchNormaliz (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_8 (Add)                      (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_25 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
res4b_branch2a (Conv2D)          (None, None, None, 25 262400                                       
____________________________________________________________________________________________________
bn4b_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_26 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4b_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4b_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_27 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4b_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
bn4b_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_9 (Add)                      (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_28 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
res4c_branch2a (Conv2D)          (None, None, None, 25 262400                                       
____________________________________________________________________________________________________
bn4c_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_29 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4c_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4c_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_30 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4c_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
bn4c_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_10 (Add)                     (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_31 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
res4d_branch2a (Conv2D)          (None, None, None, 25 262400                                       
____________________________________________________________________________________________________
bn4d_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_32 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4d_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4d_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_33 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4d_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
bn4d_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_11 (Add)                     (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_34 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
res4e_branch2a (Conv2D)          (None, None, None, 25 262400                                       
____________________________________________________________________________________________________
bn4e_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_35 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4e_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4e_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_36 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4e_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
bn4e_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_12 (Add)                     (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_37 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
res4f_branch2a (Conv2D)          (None, None, None, 25 262400                                       
____________________________________________________________________________________________________
bn4f_branch2a (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_38 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4f_branch2b (Conv2D)          (None, None, None, 25 590080                                       
____________________________________________________________________________________________________
bn4f_branch2b (FixedBatchNormali (None, None, None, 25 1024                                         
____________________________________________________________________________________________________
activation_39 (Activation)       (None, None, None, 25 0                                            
____________________________________________________________________________________________________
res4f_branch2c (Conv2D)          (None, None, None, 10 263168                                       
____________________________________________________________________________________________________
bn4f_branch2c (FixedBatchNormali (None, None, None, 10 4096                                         
____________________________________________________________________________________________________
add_13 (Add)                     (None, None, None, 10 0                                            
____________________________________________________________________________________________________
activation_40 (Activation)       (None, None, None, 10 0                                            
____________________________________________________________________________________________________
rpn_conv1 (Conv2D)               (None, None, None, 51 4719104                                      
____________________________________________________________________________________________________
rpn_out_class (Conv2D)           (None, None, None, 9) 4617                                         
____________________________________________________________________________________________________
rpn_out_regress (Conv2D)         (None, None, None, 36 18468                                        
====================================================================================================
Total params: 13,331,373
Trainable params: 13,270,189
Non-trainable params: 61,184
